# WallAlignKeyRefParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallAlignKeyRefParam Property
ParameterTypeId Class See Also
---
"Location line to align"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallAlignKeyRefParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallAlignKeyRefParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallAlignKeyRefParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace